{
	"id": "harakas",
	"title": "Dr. Peter Harakas",
	"full-title": "Peter Harakas, Ph.D, MBA",
	"licenses": [
		"Licensed Psychologist Massachusetts #9635"
	],
	"image": "therapists/harakas-small.png",
	"bio": "Dr. Harakas is a licensed clinical psychologist with training in cognitive-behavioral therapy and with a specialization in health psychology and primary care behavioral health. He has been with CBT Associates, LLC since 2013. He has extensive experience in helping clients and their caregivers cope with medical conditions and the emotional problems that often accompany medical problems. He regularly works with adolescents and adults with issues related to: depression, anxiety and phobias, including school refusal, obsessive-compulsive disorder (OCD), high-functioning autism (Asperger’s), trauma and PTSD, coping with chronic illness, career issues, work-related anxiety and stress, and couples or marital difficulties. A U.S. citizen who has also lived in the U.K. and Greece, Dr. Harakas appreciates the role culture plays in our daily lives and works with clients with diverse backgrounds. He also provides psychotherapy in Greek. \n\nDr. Harakas holds an undergraduate degree with a double major in Psychology and Marketing from the American College of Greece, a Masters of Science (MSc) degree in Applied Psychology from the University of Surrey in the U.K., and a Ph.D. in Clinical Psychology from Arizona State University. He completed his postdoctoral fellowship in Primary Care Behavioral Health at the Veterans Affairs hospital in Bedford, MA, and has also completed the University of Massachusetts Family Medicine program’s Certificate in Primary Care Behavioral Health. \n\nDr. Harakas’ clinical training includes positions in outpatient psychotherapy, university student health, family medicine and primary care, spinal cord injury, and various departments within hospitals. He has specific experience working with fibromyalgia and chronic fatigue patients and with veterans and their families. As a clinician, Dr. Harakas believes in establishing a strong therapeutic relationship based on trust and respect and adopts a collaborative approach with clients. He incorporates cognitive behavioral therapy (CBT), motivational interviewing (MI), acceptance and commitment therapy (ACT), mindfulness, and emotion-focused perspectives. As a researcher, Dr. Harakas has experience and publications in the areas of chronic pain, smoking cessation, and motivational interviewing. As a psychologist with an academic background in marketing, an MBA in leadership and transformational change, interests in consulting psychology, and work experience in leadership development, Dr. Harakas is uniquely positioned to understand the challenges faced by business professionals and executives.",
	"phone": "(617) 531-7133",
	"ext": "708",
	"email": "pharakas@cbtallc.com"
}
