{
	"id": "weinstein",
	"filepath": "contents/therapists/weinstein.json",
	"title": "Dr. Jennifer Weinstein",
	"full-title": "Jennifer Weinstein, Psy.D.",
	"image": "therapists/weinstein-small.png",
	"bio": " Dr. Weinstein is a licensed clinical psychologist and a certified clinical trauma professional and is a member of the international association of trauma professionals. She is new to CBTA, LLC. and is excited to be part of the practice. She has training in several types of trauma treatments, including EMDR. She enjoys working with adults with issues such as depression, various anxiety disorders including panic and social anxiety disorder, trauma and PTSD, adult ADHD, anger management, personal growth and spiritual development, and issues related to self-esteem, self-care, empowerment, and relationship difficulties.\n\nDr. Weinstein received her undergraduate degree with a major in psychology from the University of Massachusetts, Amherst. She received a Master’s Degree in clinical practices and her Psy.D. from the Graduate Institute of Professional Psychology at the University of Hartford. She did her internship at Stoney Brook Counseling Center in Chelmsford, MA and her postdoctoral hours were completed at Seven Hills Behavioral Health in New Bedford, MA.\n\nDr. Weinstein has had clinical training in various outpatient settings including college counseling and community mental health centers. She has extensive experience treating those suffering from substance abuse, chronic pain, HIV, depression, anxiety, PTSD and trauma, ADHD, adjustment disorders, and bipolar disorder, as well as anger management and interpersonal issues. She has worked with people of varying ethnic backgrounds and socioeconomic groups and appreciates diversity.  Dr. Weinstein has been involved with research projects at Yale University and the University of Hartford and has been a guest lecturer at the University of Hartford. Clinically, Dr. Weinstein blends CBT with other techniques such as mindfulness/meditation, Gestalt, and solution-focused therapy. She believes in building a strong therapeutic alliance with an emphasis on collaboration and values helping people to reach their highest potential."
}
