{
	"id": "muccioli",
	"filepath": "contents/therapists/muccioli.json",
	"title": "Mrs. Leanna Muccioli",
	"full-title": "Leanna Muccioli, MA, MHC",
	"image": "therapists/muccioli.png",
	"bio": "Mrs. Muccioli is a Psychotherapist and Massachusetts Licensed School Counselor grades Pre-K-12. Leanna brings experience working in dual diagnosis, which includes substance use disorders and mental health disorders, and has training and a background working in various departments of international and higher education. Leanna enjoys working with young adults and adults to identify patterns, behaviors, and areas of improving their overall quality of life. Leanna has experience working with individuals suffering from a wide range of substance use disorders, generalized anxiety disorder, major depressive disorder, trauma, bipolar disorder, and often focuses on areas of self-empowerment, self-compassion, and self-advocacy.\n\nLeanna completed a Bachelor of Arts in Communication from Worcester State University and received a Master’s Degree in Mental Health and School Counseling from Cambridge College. She completed internships within community mental health agencies and the Massachusetts public school system, and has experience working with diverse and underprivileged populations. Leanna passed the National Clinical Mental Health Counselor Exam (NCMHCE) in April 2023 and will be a fully Licensed Mental Health Counselor (LMHC) in early 2024. Leanna utilizes sessions to provide a positive, safe space and welcoming environment with the opportunity to build a relationship, foster trust, and make connections with her clients. Leanna is deeply committed to supporting those she works with, and emphasizes the importance of providing guidance and taking action early and often. Leanna believes therapy is very much a two way street, and that interventions and modalities are not one size fits all. Leanna incorporates cognitive behavioral therapy (CBT), solution-focused therapy, motivational interviewing, strengths-based therapy, positive psychology and mindfulness to encourage growth, facilitate change, and recognize progress.",
	"phone": "(617) 531-7133",
	"ext": "706",
	"email": "lmuccioli@cbtallc.com"
}