{
	"id": "stern",
	"filepath": "contents/therapists/stern.json",
	"title": "Dr. Audrey Stern",
	"full-title": "Audrey Stern, Ph.D.",
	"image": "therapists/stern.jpg",
	"bio": "Dr. Stern is a licensed clinical psychologist who works with adolescents and adults.  She treats anxiety and mood disorders, including obsessive-compulsive disorder, social anxiety, generalized anxiety disorder, panic disorder, and depression.  She also works with clients seeking effective ways to cope with stressors, including life transitions, relationship struggles, parenting challenges, and grief/loss.\n\nDr. Stern has a strong background in clinical and developmental psychology, as well as pediatric neuropsychology.  She received a B.A. in Psychology from Pomona College and a Ph.D. in Clinical Child Psychology from the University of Missouri-Columbia.  During her pre-doctoral internship at the University of Washington, she worked with children and adolescents with diverse diagnoses in an inpatient psychiatric setting at Seattle Children's Hospital and at outpatient clinics.  Dr. Stern completed a two-year postdoctoral fellowship in pediatric neuropsychology at Children's Evaluation Center (now NESCA) in Newton, MA.\n\nDr. Stern has spent much of her career supporting families.  Early on, Dr. Stern provided consultation and outpatient therapy in a community mental health clinic.  Later in private practice, Dr. Stern conducted neuropsychological evaluations with students school-aged through  college, specializing in the complex interplay of ADHD and learning disabilities with anxiety and mood disorders.\n\nAt the start of therapy, Dr. Stern assesses clients' unique strengths and challenges.  She works collaboratively with clients to develop treatment goals.  For teens, there may be parent consultation and/or family sessions in addition to individual work.   Drawing upon cognitive-behavioral therapy (CBT), she helps clients understand the link between their thoughts, feelings, and behaviors, and explores ways in which past experiences influence current reactions to stress.  Her approach is flexible and depends on the needs of each individual.  In addition to CBT, she may bring in tools from acceptance and commitment therapy, mindfulness, family systems theory, motivational interviewing, and narrative principles.\n\nDr. Stern strives to develop a warm therapeutic relationship with clients and to provide a safe space that allows for growth and change.",
	"phone": "(617) 531-7133",
	"ext": "703",
	"email": "astern@cbtallc.com"
}
