{
	"id": "stern",
	"filepath": "contents/therapists/stern.json",
	"title": "Dr. Audrey Stern",
	"full-title": "Audrey Stern, Ph.D.",
	"image": "therapists/stern.jpg",
	"bio": "Dr. Stern is a licensed clinical psychologist who works with older children (ages 9+), adolescents, and adults. She treats anxiety and mood disorders, including obsessive-compulsive disorder, social anxiety, generalized anxiety disorder, and depression. She also works with clients seeking effective ways to cope with life transitions, relationship struggles, grief and loss, and low self-esteem.\n\nDr. Stern received a B.A. in Psychology from Pomona College and a Ph.D. in Clinical Child Psychology from the University of Missouri-Columbia. During her pre-doctoral internship at the University of Washington, she worked with children and adolescents with diverse diagnoses in inpatient psychiatric setting and outpatient clinics. Dr. Stern completed a two-year postdoctoral fellowship in pediatric neuropsychology at Children&#39;s Evaluation Center (now NESCA) in Newton, MA.\n\nEarly in her career, Dr. Stern provided consultation to parents and outpatient therapy to children and teens in a community mental health clinic. Later in private practice, Dr. Stern conducted neuropsychological evaluations with children from first grade through college and collaborated with school personnel and other professionals. This background gives Dr. Stern a strong understanding of anxiety and mood disorders in the context of learning disabilities, ADHD, and Aspergers/High Functioning Autism.\n\nAt the start of therapy, Dr. Stern spends time assessing clients&#39; unique challenges and strengths. She works collaboratively with clients and families to develop treatment goals. For children and teens, there may be parent consultation and/or family sessions in addition to individual work. Drawing upon cognitive-behavioral and psychodynamic principles, she helps clients understand the link between their thoughts, feelings, and behaviors, and explores ways in which past experiences influence current reactions to stress. Her approach is flexible and depends on the needs of each individual. She may bring in problem-solving tools from mindfulness, family systems theory, motivational interviewing, and narrative principles.\n\nDr. Stern strives to develop a warm therapeutic relationship with clients and to provide a safe space that allows for growth and change.",
	"phone": "(617) 531-7133",
	"ext": "703",
	"email": "astern@cbtallc.com"
}
